// 定義每個呼吸法的資料
final List<Map<String, String>> breathingInfo = [
  {
    'title': '4-7-8 呼吸法',
    'shortID': '適合在感到焦慮、無法入睡時使用',
    'detailed': '4-7-8呼吸法是一種能有效減少焦慮並改善睡眠的技巧。這種方法有助於放慢呼吸速度，促進身體進入深度放鬆的狀態。當你難以入睡或面臨極大壓力與焦慮時，這項技巧特別有幫助。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 7 秒',
    'exhale': '呼氣 8 秒',
  },
  {
    'title': '4-2-6 呼吸法',
    'shortID': '適合壓力大的情況下，回到平靜狀態',
    'detailed': '是幫助從交感神經系統（逃跑或戰鬥反應）轉移到副交感神經系統（休息和消化狀態）。這種方法可以促進橫膈膜呼吸，幫助身體回到平靜狀態，減少壓力和焦慮。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 2 秒',
    'exhale': '呼氣 6 秒',
  },
  {
    'title': '盒式呼吸',
    'shortID': '適合在工作或需要提升專注力時使用',
    'detailed': '盒式呼吸法，又稱為四方呼吸，是一種簡單的呼吸技巧，主要用於幫助減輕壓力、提升專注力和促進放鬆。它可以幫助調節自主神經系統，減少焦慮並改善心理狀態。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 4 秒',
    'exhale': '呼氣 4 秒',
  },
  {
    'title': '3-3-3 呼吸法',
    'shortID': '適合日常短暫休息時應用',
    'detailed': '3-3-3呼吸法，幫助個人快速放鬆、減少壓力和焦慮感，有助於平靜神經系統的快速呼吸法，可以在日常生活中隨時隨地應用。當您感到焦慮或壓力並需要快速恢復平靜時，這是一個很好的工具。',
    'inhale': '吸氣 3 秒',
    'hold': '屏息 3 秒',
    'exhale': '呼氣 3 秒',
  },
];